
Create a Series from a list of integers representing daily temperatures (in Celsius) over a week. 
Assign index labels as day of the week.
a. Find and print the average (mean) temperature for the week. 
b. Identify and print the maximum and minimum temperatures and their respective days. 
c. Display the temperatures greater than a specific value.
d. Convert all temperatures to Fahrenheit.
e. Print the days had temperatures above the average.

In [14]:
#Create a Series from a list of integers representing daily temperatures (in Celsius) over a week. Assign index labels as day of the week
import pandas as pd
a=[30,34,27,38,43,23,45]
temp=pd.Series(a,index=["MON","TUE","WED","THU","FRI","SAT","SUN"])
print(temp)

MON    30
TUE    34
WED    27
THU    38
FRI    43
SAT    23
SUN    45
dtype: int64

In [16]:
#a. Find and print the average (mean) temperature for the week.
avg=temp.mean()
print("average is : ",avg)

average is :  34.285714285714285

In [30]:
#c. Display the temperatures greater than a specific value.
input_temp=int(input("enter temp"))

display=temp[temp>input_temp]


#farehit conversion
far=temp.apply(lambda x: (x * 9/5) + 32)


display2=temp[temp>avg]
display2

enter temp 42

THU    38
FRI    43
SUN    45
dtype: int64

In [75]:
temp_fahrenheit = temp * 9/5 + 32
print("\nTemperatures in Fahrenheit:")
print(temp_fahrenheit)

Temperatures in Fahrenheit:
MON     86.0
TUE     93.2
WED     80.6
THU    100.4
FRI    109.4
SAT     73.4
SUN    113.0
dtype: float64

In [71]:
#c. Display the temperatures greater than a specific value.
input_temp=int(input("enter temp"))

display=temp[temp>input_temp]
display

enter temp 30

TUE    34
THU    38
FRI    43
SUN    45
dtype: int64

In [44]:
#c. Display the temperatures greater than a specific value.
input_temp=int(input("enter temp"))

for i in range(a):
    if a>input_temp:
        print(temp)

enter temp 32

TypeError: 'list' object cannot be interpreted as an integer

In [22]:
# b. Identify and print the maximum and minimum temperatures and their respective days. 
max1=temp.max()
min1=temp.min()

max_Pos=temp.idxmax()
min_Pos=temp.idxmin()

print(f"the maximum temp is {max1} on {max_Pos}")
print("the max value is",max1,"on",max_Pos)

print(f"the maximum temp is {min1} on {min_Pos}")

the maximum temp is 45 on SUN
the max value is 45 on SUN
the maximum temp is 23 on SAT

In [12]:
import pandas as pd
a=[30,34,27,38,43,23,45]
temp=pd.Series(a,index=["MON","TUE","WED","THU","FRI","SAT","SUN"])
print(temp)
avg=temp.mean()
print("average is : ",avg)

max1=temp.max()
min1=temp.min()

max_Pos=temp.idxmax()
min_Pos=temp.idxmin()

input_temp=int(input("enter temp"))

display=temp[temp>input_temp]

far=temp.apply(lambda x: (x * 9/5) + 32)


display2=temp[temp>avg]

print(f"the maximum temp is {max1} on {max_Pos}")


print(f"the maximum temp is {min1} on {min_Pos}")

print("Temp above specified ")
print(display)
print("farheit")
print(far)
print("temp above avg ")
print(display2)

MON    30
TUE    34
WED    27
THU    38
FRI    43
SAT    23
SUN    45
dtype: int64
average is :  34.285714285714285

enter temp 4

the maximum temp is 45 on SUN
the maximum temp is 23 on SAT
Temp above specified
MON    30
TUE    34
WED    27
THU    38
FRI    43
SAT    23
SUN    45
dtype: int64
farheit
MON     86.0
TUE     93.2
WED     80.6
THU    100.4
FRI    109.4
SAT     73.4
SUN    113.0
dtype: float64
temp above avg
THU    38
FRI    43
SUN    45
dtype: int64

. Create a data frame with details of 10 students and columns as Roll Number, Name, Gender, Marks1, Marks2, Marks3. a. Create a new column with total marks b. Find the lowest marks in Marks1 c. Find the Highest marks in Marks2 d. Find the average marks in Marks3 e. Find student name with highest average f. Find how many students failed in Marks2 (<40)

In [48]:
import pandas as pd
data ={ " Roll Number":[29,27,45,34,63,23,54,34,34,54],"Name":['mit',"wer","wes","rtd","erd","poe","ine","nir","mne","ert"],"gender":["male", "female", "male", "female", "male", "female", "male", "female", "male", "female"],'Marks1': [85, 90, 78, 92, 88, 75, 80, 95, 89, 83],
    'Marks2': [76, 89, 4, 9, 87, 79, 85, 93, 88, 82],
    'Marks3': [80, 85, 23, 3, 90, 77, 81, 96, 86, 84]}
df = pd.DataFrame(data)
data
df['total']=df['Marks1']+df['Marks2']+df['Marks3']

min1=df['Marks1'].min()

print("minimum",min1)

max1=df['Marks2'].max()
print("maximum in marks2",max1)

avg=df['Marks3'].mean()
print("average is ",avg)


df['average']=df['total']/3
high_avg=df['average'].max()
print(f"highest average is {high_avg} ")

""" other way"""

avg2=(df['total'].max())/3
print(f"highest average is {avg2} ")

high_stu=df.loc[df['average'].idxmax(),'Name']

print(f"hghest average student is {high_stu}")

failed=len(df.loc[df['Marks2']<40])
print("number of failed in marks2",failed)

minimum 75
maximum in marks2 93
average is  70.5
highest average is 94.66666666666667
highest average is 94.66666666666667
hghest average student is nir
number of failed in marks2 2

In [59]:
import pandas as pd
data ={ " Roll Number":[29,27,45,34,63,23,54,34,34,54],"Name":['mit',"wer","wes","rtd","erd","poe","ine","nir","mne","ert"],"gender":["male", "female", "male", "female", "male", "female", "male", "female", "male", "female"],'Marks1': [85, 90, 78, 92, 88, 75, 80, 95, 89, 83],
    'Marks2': [76, 89, 4, 9, 87, 79, 85, 93, 88, 82],
    'Marks3': [80, 85, 23, 3, 90, 77, 81, 96, 86, 84]}
df = pd.DataFrame(data)
data
df['total']=df['Marks1']+df['Marks2']+df['Marks3']
df

    Roll Number Name  gender  Marks1  Marks2  Marks3  total
0            29  mit    male      85      76      80    241
1            27  wer  female      90      89      85    264
2            45  wes    male      78       4      23    105
3            34  rtd  female      92       9       3    104
4            63  erd    male      88      87      90    265
5            23  poe  female      75      79      77    231
6            54  ine    male      80      85      81    246
7            34  nir  female      95      93      96    284
8            34  mne    male      89      88      86    263
9            54  ert  female      83      82      84    249

In [79]:
import pandas as pd
data ={ " Roll Number":[29,27,45,34,63,23,54,34,34,54],"Name":['mit',"wer","wes","rtd","erd","poe","ine","nir","mne","ert"],"gender":["male", "female", "male", "female", "male", "female", "male", "female", "male", "female"],'Marks1': [85, 90, 78, 92, 88, 75, 80, 95, 89, 83],
    'Marks2': [76, 89, 4, 9, 87, 79, 85, 93, 88, 82],
    'Marks3': [80, 85, 23, 3, 90, 77, 81, 96, 86, 84]}
df = pd.DataFrame(data)
df

    Roll Number Name  gender  Marks1  Marks2  Marks3
0            29  mit    male      85      76      80
1            27  wer  female      90      89      85
2            45  wes    male      78       4      23
3            34  rtd  female      92       9       3
4            63  erd    male      88      87      90
5            23  poe  female      75      79      77
6            54  ine    male      80      85      81
7            34  nir  female      95      93      96
8            34  mne    male      89      88      86
9            54  ert  female      83      82      84

In [83]:
df['total']=df['Marks1']+df['Marks2']+df['Marks3']
df

    Roll Number Name  gender  Marks1  Marks2  Marks3  total
0            29  mit    male      85      76      80    241
1            27  wer  female      90      89      85    264
2            45  wes    male      78       4      23    105
3            34  rtd  female      92       9       3    104
4            63  erd    male      88      87      90    265
5            23  poe  female      75      79      77    231
6            54  ine    male      80      85      81    246
7            34  nir  female      95      93      96    284
8            34  mne    male      89      88      86    263
9            54  ert  female      83      82      84    249

In [89]:
min1=df['Marks1'].idxmin()
min1

5

In [97]:
df['average']=df['total']/3
df

    Roll Number Name  gender  Marks1  Marks2  Marks3  total    average
0            29  mit    male      85      76      80    241  80.333333
1            27  wer  female      90      89      85    264  88.000000
2            45  wes    male      78       4      23    105  35.000000
3            34  rtd  female      92       9       3    104  34.666667
4            63  erd    male      88      87      90    265  88.333333
5            23  poe  female      75      79      77    231  77.000000
6            54  ine    male      80      85      81    246  82.000000
7            34  nir  female      95      93      96    284  94.666667
8            34  mne    male      89      88      86    263  87.666667
9            54  ert  female      83      82      84    249  83.000000

In [105]:
high_stu=df.loc[df['average'].idxmax(),'Name']

print(f"hghest average student is {high_stu}")

hghest average student is nir

In [107]:

failed=len([df['Marks2']<40])
print("number of failed in marks2",failed)

number of failed in marks2 1

In [109]:

failed=len(df[df['Marks2']<40])
print("number of failed in marks2",failed)

number of failed in marks2 2

In [117]:
failed1=df[df['Marks2']<40]
failed1
print(len(failed1))

2

In [127]:
failed1=df[df['Marks2']<40]
print(failed1)
print("no failed",len(failed1))

    Roll Number Name  gender  Marks1  Marks2  Marks3  total    average
2            45  wes    male      78       4      23    105  35.000000
3            34  rtd  female      92       9       3    104  34.666667
no failed 2

In [119]:

failed=len(df.loc[df['Marks2']<40])
print("number of failed in marks2",failed)

number of failed in marks2 2

In [133]:
failed=df.loc[df['Marks2']<40,]
print(failed)

    Roll Number Name  gender  Marks1  Marks2  Marks3  total    average
2            45  wes    male      78       4      23    105  35.000000
3            34  rtd  female      92       9       3    104  34.666667